In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd

# a simple list
list = [4,8,15,16,23,42]

# create series form a list
ser = pd.Series(list)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''

list = [7,'abc',9,67,'',8,2,5,1,4]
ser = pd.Series(list)
print(ser)

0      7
1    abc
2      9
3     67
4
5      8
6      2
7      5
8      1
9      4
dtype: object

In [1]:
'''. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.'''

# importing pandas as pd
import pandas as pd

# dictionary of lists
dict = {'name':["alice","bob","claire"],'age':[25,30,27],'gender':['female','male','female']}

df = pd.DataFrame(dict)

print(df)

     name  age  gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

The Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns.

The Pandas DataFrame is a two-dimensional data structure composed of columns and rows.

A Series is a data structure representing a single row or column of a DataFrame,whereas a DataFrame (table) is simply a container that holds many Series objects (columns) together.

In [2]:
df['name']

0     alice
1       bob
2    claire
Name: name, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.
Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.
Summary of Statistics of DataFrame using describe() method.
Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.
Merging DataFrames using merge(), arguments passed are the dataframes to be merged along with the column name.

In [3]:
df.head(2)

    name  age  gender
0  alice   25  female
1    bob   30    male

In [4]:
df.tail(2)

     name  age  gender
1     bob   30    male
2  claire   27  female

In [5]:
df.describe()

             age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series – 1D labeled homogeneous array, sizeimmutable
Data Frames – 2D labeled, size-mutable tabular structure with heterogenic columns
Panel – 3D labeled size mutable array.

Q7. Create a DataFrame using multiple Series. Explain with an example.


By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [6]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000